TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получает значение по указанному документу "Формирование номера пробы"
// 
// Параметры:
//  ФормированиеНомераПробы - ДокументСсылка.гкс_ФормированиеНомераПробы - ссылка на исходный документ
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - значение для лаб. анализа
//
Функция ЗначениеПоДокументуФормированиеНомераПробы(ФормированиеНомераПробы) Экспорт

	Результат = ПустаяСсылка();
	ТипПробы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормированиеНомераПробы, "ТипПробы");

	Если ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
		Результат = ПриемкаКомпозит;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегистрацияНаПЛК.ТипРегистрации КАК ТипРегистрации
		|ИЗ
		|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|ГДЕ
		|	ФормированиеНомераПробыСписокРегистраций.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ФормированиеНомераПробы);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			
			Результат = ПолучитьПоТипуРегистрации(ВыборкаДетальныеЗаписи.ТипРегистрации);
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Получить по типу регистрации.
// 
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - 
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - Получить по типу регистрации
//
Функция ПолучитьПоТипуРегистрации(ТипРегистрации) Экспорт
	
	Если ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		Возврат Приемка;	
	ИначеЕсли ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка Тогда
		Возврат Отгрузка;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

// Проверяет является ли значение назначения использования качества - "Приемка"
//
// Параметры:
// 	Значение - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества
//
// Возвращаемое значение:
//		Булево - Истина, если "Приемка"
//
Функция ЭтоПриемка(Значение) Экспорт
	
	Возврат Значение = Приемка;
	
КонецФункции
		
// Проверяет является ли значение назначения использования качества - "Приемка композит" 
//
// Параметры:
// 	Значение - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества
//
// Возвращаемое значение:
//		Булево - Истина, если "приемка композит"
//
Функция ЭтоПриемкаКомпозит(Значение) Экспорт
	
	Возврат Значение = ПриемкаКомпозит;
	
КонецФункции

// Проверяет является ли значение назначения использования качества - "Промежуточный композит"
//
// Параметры:
// 	Значение - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества
//
// Возвращаемое значение:
//		Булево - Истина, если "Промежуточный композит"
//
Функция ЭтоПромежуточныйКомпозит(Значение) Экспорт
	
	Возврат Значение = ПромежуточныйКомпозит;
	
КонецФункции

// Проверяет является ли значение назначения использования качества - "Перепроверка внешних проб"
//
// Параметры:
// 	Значение - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества
//
// Возвращаемое значение:
//		Булево - Истина, если "Перепроверка внешних проб"
//
Функция ЭтоПерепроверкаВнешнихПроб(Значение) Экспорт
	
	Возврат Значение = ПерепроверкаВнешнихПроб;
	
КонецФункции

// Определяет Тип пробы по назначению использования качества.
// 
// Параметры:
//  НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - проверяемое значение
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_ТипыПроб - Тип пробы, полученный по назначению использования качества.
//
Функция ТипПробыПоНазначениюИспользованияКачества(НазначениеИспользования) Экспорт
	
	Если СоответствуетТипуПробыКомпозитная(НазначениеИспользования) Тогда
		Возврат Перечисления.гкс_ТипыПроб.Композитная;
	ИначеЕсли СоответствуетТипуПробыЕдиничная(НазначениеИспользования) Тогда
		Возврат Перечисления.гкс_ТипыПроб.Единичная;
	Иначе 
		Возврат Перечисления.гкс_ТипыПроб.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствуетТипуПробыЕдиничная(НазначениеИспользования)
	
	КоллекцияНазначенийИспользования = Новый Массив;
	КоллекцияНазначенийИспользования.Добавить(Приемка);
	КоллекцияНазначенийИспользования.Добавить(ДополнительныйАнализ);
	
	Возврат Не КоллекцияНазначенийИспользования.Найти(НазначениеИспользования) = Неопределено;
	
КонецФункции

Функция СоответствуетТипуПробыКомпозитная(НазначениеИспользования)
	
	КоллекцияНазначенийИспользования = Новый Массив;
	КоллекцияНазначенийИспользования.Добавить(ПриемкаКомпозит);
	КоллекцияНазначенийИспользования.Добавить(ПромежуточныйКомпозит);
	КоллекцияНазначенийИспользования.Добавить(ПерепроверкаВнешнихПроб);
	
	Возврат Не КоллекцияНазначенийИспользования.Найти(НазначениеИспользования) = Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
